docs/benchmark/go-pmem-redis.txt
[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 128 -n 100000
====== SET ======
  100000 requests completed in 1.59 seconds
  50 parallel clients
  128 bytes payload
  keep alive: 1

82.22% <= 1 milliseconds
97.68% <= 2 milliseconds
98.59% <= 3 milliseconds
99.03% <= 4 milliseconds
99.35% <= 5 milliseconds
99.60% <= 6 milliseconds
99.88% <= 7 milliseconds
99.93% <= 8 milliseconds
99.95% <= 9 milliseconds
99.96% <= 10 milliseconds
99.97% <= 11 milliseconds
100.00% <= 13 milliseconds
63091.48 requests per second

====== GET ======
  100000 requests completed in 1.30 seconds
  50 parallel clients
  128 bytes payload
  keep alive: 1

98.60% <= 1 milliseconds
98.83% <= 2 milliseconds
98.85% <= 3 milliseconds
98.92% <= 4 milliseconds
99.06% <= 5 milliseconds
99.58% <= 6 milliseconds
99.69% <= 7 milliseconds
99.72% <= 8 milliseconds
99.78% <= 9 milliseconds
99.80% <= 10 milliseconds
99.83% <= 11 milliseconds
99.84% <= 12 milliseconds
99.85% <= 13 milliseconds
99.86% <= 14 milliseconds
99.86% <= 15 milliseconds
99.90% <= 16 milliseconds
99.93% <= 17 milliseconds
99.93% <= 18 milliseconds
99.93% <= 19 milliseconds
99.93% <= 20 milliseconds
99.94% <= 21 milliseconds
99.96% <= 22 milliseconds
99.97% <= 23 milliseconds
99.97% <= 24 milliseconds
99.98% <= 25 milliseconds
99.99% <= 27 milliseconds
99.99% <= 30 milliseconds
99.99% <= 33 milliseconds
99.99% <= 37 milliseconds
99.99% <= 38 milliseconds
99.99% <= 39 milliseconds
100.00% <= 41 milliseconds
100.00% <= 45 milliseconds
100.00% <= 46 milliseconds
100.00% <= 55 milliseconds
100.00% <= 64 milliseconds
100.00% <= 68 milliseconds
76804.91 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 512 -n 100000
====== SET ======
  100000 requests completed in 1.67 seconds
  50 parallel clients
  512 bytes payload
  keep alive: 1

78.60% <= 1 milliseconds
97.36% <= 2 milliseconds
98.11% <= 3 milliseconds
98.66% <= 4 milliseconds
98.96% <= 5 milliseconds
99.32% <= 6 milliseconds
99.75% <= 7 milliseconds
99.81% <= 8 milliseconds
99.87% <= 9 milliseconds
99.90% <= 10 milliseconds
99.94% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 22 milliseconds
59737.16 requests per second

====== GET ======
  100000 requests completed in 1.32 seconds
  50 parallel clients
  512 bytes payload
  keep alive: 1

98.52% <= 1 milliseconds
98.73% <= 2 milliseconds
98.77% <= 3 milliseconds
98.93% <= 4 milliseconds
99.09% <= 5 milliseconds
99.52% <= 6 milliseconds
99.70% <= 7 milliseconds
99.76% <= 8 milliseconds
99.80% <= 9 milliseconds
99.81% <= 10 milliseconds
99.90% <= 11 milliseconds
99.90% <= 12 milliseconds
99.91% <= 13 milliseconds
99.91% <= 14 milliseconds
99.92% <= 15 milliseconds
99.93% <= 16 milliseconds
99.94% <= 17 milliseconds
99.96% <= 18 milliseconds
99.96% <= 19 milliseconds
99.96% <= 20 milliseconds
99.97% <= 21 milliseconds
99.97% <= 23 milliseconds
99.97% <= 24 milliseconds
99.97% <= 25 milliseconds
99.98% <= 26 milliseconds
99.98% <= 30 milliseconds
99.98% <= 31 milliseconds
99.98% <= 33 milliseconds
99.99% <= 35 milliseconds
99.99% <= 38 milliseconds
99.99% <= 39 milliseconds
99.99% <= 43 milliseconds
99.99% <= 44 milliseconds
99.99% <= 45 milliseconds
99.99% <= 46 milliseconds
100.00% <= 48 milliseconds
100.00% <= 50 milliseconds
100.00% <= 51 milliseconds
100.00% <= 55 milliseconds
100.00% <= 65 milliseconds
100.00% <= 70 milliseconds
75815.01 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 1024 -n 100000
====== SET ======
  100000 requests completed in 1.82 seconds
  50 parallel clients
  1024 bytes payload
  keep alive: 1

74.26% <= 1 milliseconds
96.55% <= 2 milliseconds
97.78% <= 3 milliseconds
98.25% <= 4 milliseconds
98.69% <= 5 milliseconds
99.01% <= 6 milliseconds
99.64% <= 7 milliseconds
99.87% <= 8 milliseconds
99.94% <= 9 milliseconds
99.98% <= 10 milliseconds
99.98% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
54975.26 requests per second

====== GET ======
  100000 requests completed in 1.33 seconds
  50 parallel clients
  1024 bytes payload
  keep alive: 1

99.12% <= 1 milliseconds
99.35% <= 2 milliseconds
99.39% <= 3 milliseconds
99.43% <= 4 milliseconds
99.60% <= 5 milliseconds
99.68% <= 6 milliseconds
99.80% <= 7 milliseconds
99.83% <= 8 milliseconds
99.87% <= 9 milliseconds
99.88% <= 10 milliseconds
99.88% <= 11 milliseconds
99.89% <= 12 milliseconds
99.92% <= 13 milliseconds
99.93% <= 14 milliseconds
99.94% <= 15 milliseconds
99.94% <= 16 milliseconds
99.95% <= 17 milliseconds
99.97% <= 18 milliseconds
99.97% <= 19 milliseconds
99.97% <= 20 milliseconds
99.97% <= 21 milliseconds
99.98% <= 23 milliseconds
99.98% <= 24 milliseconds
99.98% <= 25 milliseconds
99.98% <= 27 milliseconds
99.98% <= 28 milliseconds
99.99% <= 29 milliseconds
99.99% <= 31 milliseconds
99.99% <= 32 milliseconds
99.99% <= 33 milliseconds
99.99% <= 34 milliseconds
99.99% <= 35 milliseconds
99.99% <= 36 milliseconds
100.00% <= 39 milliseconds
100.00% <= 41 milliseconds
100.00% <= 42 milliseconds
100.00% <= 44 milliseconds
100.00% <= 45 milliseconds
75471.70 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 4096 -n 100000
====== SET ======
  100000 requests completed in 2.53 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

53.42% <= 1 milliseconds
90.28% <= 2 milliseconds
96.40% <= 3 milliseconds
97.96% <= 4 milliseconds
98.66% <= 5 milliseconds
99.07% <= 6 milliseconds
99.39% <= 7 milliseconds
99.76% <= 8 milliseconds
99.91% <= 9 milliseconds
99.93% <= 10 milliseconds
99.95% <= 11 milliseconds
99.98% <= 12 milliseconds
100.00% <= 12 milliseconds
39541.32 requests per second

^CT: 1250.16
[root@iZbp1gqpip163xihy2oh56Z ~]#
[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 4096 -n 100000
====== SET ======
  100000 requests completed in 2.57 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

52.04% <= 1 milliseconds
89.33% <= 2 milliseconds
96.26% <= 3 milliseconds
98.08% <= 4 milliseconds
98.78% <= 5 milliseconds
99.08% <= 6 milliseconds
99.49% <= 7 milliseconds
99.80% <= 8 milliseconds
99.92% <= 9 milliseconds
99.96% <= 10 milliseconds
99.98% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
38955.98 requests per second

^CT: 1250.64
[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 4096 -n 10000
====== SET ======
  10000 requests completed in 0.26 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

49.57% <= 1 milliseconds
86.93% <= 2 milliseconds
97.56% <= 3 milliseconds
98.69% <= 4 milliseconds
99.23% <= 5 milliseconds
99.54% <= 6 milliseconds
99.68% <= 7 milliseconds
99.86% <= 8 milliseconds
99.96% <= 9 milliseconds
100.00% <= 9 milliseconds
38759.69 requests per second

^CT: 1252.09
[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 4096 -n 5000
====== SET ======
  5000 requests completed in 0.13 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

52.50% <= 1 milliseconds
90.54% <= 2 milliseconds
95.98% <= 3 milliseconds
97.72% <= 4 milliseconds
98.58% <= 5 milliseconds
98.92% <= 6 milliseconds
99.38% <= 7 milliseconds
99.84% <= 8 milliseconds
99.90% <= 9 milliseconds
100.00% <= 10 milliseconds
38167.94 requests per second

====== GET ======
  5000 requests completed in 3.96 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

99.18% <= 1 milliseconds
100.00% <= 1 milliseconds
1261.03 requests per second

[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 8192 -n 1000
====== SET ======
  1000 requests completed in 0.04 seconds
  50 parallel clients
  8192 bytes payload
  keep alive: 1

31.20% <= 1 milliseconds
73.50% <= 2 milliseconds
93.50% <= 3 milliseconds
96.10% <= 4 milliseconds
98.90% <= 7 milliseconds
100.00% <= 9 milliseconds
27777.78 requests per second

====== GET ======
  1000 requests completed in 0.76 seconds
  50 parallel clients
  8192 bytes payload
  keep alive: 1

94.40% <= 1 milliseconds
99.00% <= 2 milliseconds
100.00% <= 2 milliseconds
1308.90 requests per second

[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 10240 -n 5000
====== SET ======
  5000 requests completed in 0.19 seconds
  50 parallel clients
  10240 bytes payload
  keep alive: 1

25.16% <= 1 milliseconds
64.28% <= 2 milliseconds
88.94% <= 3 milliseconds
96.76% <= 4 milliseconds
98.38% <= 5 milliseconds
99.08% <= 6 milliseconds
99.58% <= 7 milliseconds
99.82% <= 10 milliseconds
99.84% <= 11 milliseconds
99.98% <= 12 milliseconds
100.00% <= 12 milliseconds
26178.01 requests per second

====== GET ======
  5000 requests completed in 3.97 seconds
  50 parallel clients
  10240 bytes payload
  keep alive: 1

99.00% <= 1 milliseconds
99.06% <= 2 milliseconds
99.60% <= 3 milliseconds
99.70% <= 4 milliseconds
100.00% <= 4 milliseconds
1260.72 requests per second