docs/benchmark/kvrocks.txt
[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -p 6666 -t set,get -d 128 -n 100000
====== SET ======
  100000 requests completed in 4.44 seconds
  50 parallel clients
  128 bytes payload
  keep alive: 1

5.25% <= 1 milliseconds
49.62% <= 2 milliseconds
97.38% <= 3 milliseconds
99.78% <= 4 milliseconds
99.91% <= 5 milliseconds
99.95% <= 6 milliseconds
99.96% <= 7 milliseconds
99.97% <= 8 milliseconds
99.99% <= 9 milliseconds
99.99% <= 11 milliseconds
100.00% <= 11 milliseconds
22517.45 requests per second

====== GET ======
  100000 requests completed in 3.65 seconds
  50 parallel clients
  128 bytes payload
  keep alive: 1

4.48% <= 1 milliseconds
90.42% <= 2 milliseconds
99.60% <= 3 milliseconds
99.93% <= 4 milliseconds
99.96% <= 5 milliseconds
99.96% <= 6 milliseconds
99.96% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 11 milliseconds
100.00% <= 11 milliseconds
27359.78 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -p 6666 -t set,get -d 512 -n 100000
====== SET ======
  100000 requests completed in 4.61 seconds
  50 parallel clients
  512 bytes payload
  keep alive: 1

5.74% <= 1 milliseconds
40.38% <= 2 milliseconds
95.88% <= 3 milliseconds
99.33% <= 4 milliseconds
99.71% <= 5 milliseconds
99.87% <= 6 milliseconds
99.90% <= 7 milliseconds
99.93% <= 8 milliseconds
99.95% <= 9 milliseconds
99.97% <= 10 milliseconds
99.97% <= 11 milliseconds
99.97% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
21715.53 requests per second

====== GET ======
  100000 requests completed in 3.71 seconds
  50 parallel clients
  512 bytes payload
  keep alive: 1

4.57% <= 1 milliseconds
89.52% <= 2 milliseconds
99.60% <= 3 milliseconds
99.95% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
26932.40 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -p 6666 -t set,get -d 1024 -n 100000
====== SET ======
  100000 requests completed in 4.71 seconds
  50 parallel clients
  1024 bytes payload
  keep alive: 1

6.14% <= 1 milliseconds
39.98% <= 2 milliseconds
93.56% <= 3 milliseconds
98.52% <= 4 milliseconds
99.14% <= 5 milliseconds
99.49% <= 6 milliseconds
99.89% <= 7 milliseconds
99.96% <= 8 milliseconds
100.00% <= 8 milliseconds
21249.47 requests per second

====== GET ======
  100000 requests completed in 3.70 seconds
  50 parallel clients
  1024 bytes payload
  keep alive: 1

3.93% <= 1 milliseconds
90.14% <= 2 milliseconds
99.59% <= 3 milliseconds
99.98% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
27005.13 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -p 6666 -t set,get -d 4096 -n 100000
====== SET ======
  100000 requests completed in 6.15 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

5.34% <= 1 milliseconds
18.51% <= 2 milliseconds
62.33% <= 3 milliseconds
88.54% <= 4 milliseconds
94.81% <= 5 milliseconds
97.30% <= 6 milliseconds
98.54% <= 7 milliseconds
99.27% <= 8 milliseconds
99.57% <= 9 milliseconds
99.72% <= 10 milliseconds
99.82% <= 11 milliseconds
99.89% <= 12 milliseconds
99.94% <= 13 milliseconds
99.94% <= 14 milliseconds
99.95% <= 15 milliseconds
99.96% <= 16 milliseconds
99.96% <= 18 milliseconds
99.97% <= 19 milliseconds
99.98% <= 20 milliseconds
99.99% <= 23 milliseconds
99.99% <= 24 milliseconds
99.99% <= 25 milliseconds
100.00% <= 25 milliseconds
16268.10 requests per second

====== GET ======
  100000 requests completed in 4.19 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

2.78% <= 1 milliseconds
72.19% <= 2 milliseconds
97.98% <= 3 milliseconds
99.92% <= 4 milliseconds
99.95% <= 10 milliseconds
99.95% <= 12 milliseconds
99.99% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 14 milliseconds
23860.65 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -p 6666 -t set,get -d 8192 -n 100000
====== SET ======
  100000 requests completed in 7.40 seconds
  50 parallel clients
  8192 bytes payload
  keep alive: 1

3.72% <= 1 milliseconds
16.75% <= 2 milliseconds
42.93% <= 3 milliseconds
71.49% <= 4 milliseconds
85.00% <= 5 milliseconds
91.39% <= 6 milliseconds
95.00% <= 7 milliseconds
96.82% <= 8 milliseconds
98.10% <= 9 milliseconds
98.81% <= 10 milliseconds
99.31% <= 11 milliseconds
99.67% <= 12 milliseconds
99.76% <= 13 milliseconds
99.85% <= 14 milliseconds
99.93% <= 15 milliseconds
99.97% <= 16 milliseconds
99.98% <= 17 milliseconds
99.98% <= 18 milliseconds
100.00% <= 18 milliseconds
13515.34 requests per second

====== GET ======
  100000 requests completed in 4.43 seconds
  50 parallel clients
  8192 bytes payload
  keep alive: 1

2.86% <= 1 milliseconds
63.44% <= 2 milliseconds
97.00% <= 3 milliseconds
99.77% <= 4 milliseconds
99.92% <= 5 milliseconds
99.95% <= 6 milliseconds
99.95% <= 7 milliseconds
99.97% <= 8 milliseconds
100.00% <= 8 milliseconds
22588.66 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -p 6666 -t set,get -d 10240 -n 100000
====== SET ======
  100000 requests completed in 7.91 seconds
  50 parallel clients
  10240 bytes payload
  keep alive: 1

5.37% <= 1 milliseconds
17.37% <= 2 milliseconds
39.31% <= 3 milliseconds
66.30% <= 4 milliseconds
80.74% <= 5 milliseconds
87.79% <= 6 milliseconds
92.00% <= 7 milliseconds
94.73% <= 8 milliseconds
96.36% <= 9 milliseconds
97.65% <= 10 milliseconds
98.44% <= 11 milliseconds
98.93% <= 12 milliseconds
99.21% <= 13 milliseconds
99.43% <= 14 milliseconds
99.59% <= 15 milliseconds
99.69% <= 16 milliseconds
99.79% <= 17 milliseconds
99.84% <= 18 milliseconds
99.88% <= 19 milliseconds
99.91% <= 20 milliseconds
99.94% <= 21 milliseconds
99.97% <= 22 milliseconds
99.97% <= 23 milliseconds
99.99% <= 24 milliseconds
99.99% <= 25 milliseconds
100.00% <= 26 milliseconds
100.00% <= 26 milliseconds
12642.23 requests per second

====== GET ======
  100000 requests completed in 4.52 seconds
  50 parallel clients
  10240 bytes payload
  keep alive: 1

1.81% <= 1 milliseconds
58.25% <= 2 milliseconds
96.75% <= 3 milliseconds
99.81% <= 4 milliseconds
99.95% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 9 milliseconds
22114.11 requests per second